_Rarzrabotki/Kazna/Documents/РаспределениеЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РаспределениеЗаработнойПлаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиратьТабельПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределятьНаправлениеПоТабелю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиИсключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ДанныеТабелирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДанныеТабелирования</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисленияНаЗарплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУдержанияСЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоКарточке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/РаспределениеЗаработнойПлаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	Если Элементы.Сотрудники.ТекущаяСтрока=Неопределено Тогда
		
	Иначе	
		Элементы.Распределение.ОтборСтрок=Новый ФиксированнаяСтруктура("Сотрудник",Элементы.Сотрудники.ТекущиеДанные.Сотрудник);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Если Элементы.Сотрудники.ТекущаяСтрока=Неопределено Тогда
		
	Иначе	
		Элементы.Распределение.ОтборСтрок=Новый ФиксированнаяСтруктура("Сотрудник",Элементы.Сотрудники.ТекущиеДанные.Сотрудник);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Распределение.ТекущиеДанные.Сотрудник= Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИзБухгалтерииНаСервере()
	V8=Новый COMОбъект("V83.COMConnector");
	Сервер="1csql";
	БазаДанных="kompas_upr";
	
	//СтрПодключения="File="""+СокрЛП(ПутьКБазе)+""";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ321""";
	//СтрПодключения="srvr='" + Сервер + "'; ref='" + БазаДанных +""";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ321""";
	//Srvr="localhost";Ref="upp_ac";
	//Если Объект.Организация.Код="000000088" Тогда
	//	СтрПодключения="srvr=""sql"";ref=""bu_trans"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	//ИначеЕсли Объект.Организация.Код="000000087" Тогда
	//	СтрПодключения="srvr=""sql"";ref=""bu_stil"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";	
	//Иначе
	//	СтрПодключения="srvr=""sql"";ref=""gp"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	//КонецЕсли;
	
	СтрПодключения="srvr=""localhost"";ref=""zup"";Usr=""АвтообменБУ"";Pwd=""АвтообменБУ123""";
	
	//Сообщить(СтрПодключения);
	Попытка   
		БазаПР=V8.Connect(СтрПодключения);
	Исключение
		сообщить(ОписаниеОшибки());
		
		Сообщить("Ошибка при подключении!");
		ЕстьПодключение = Ложь;
	КонецПопытки;
	
	ЕстьПодключение= Истина;
	
	
	ЗапросБУ=  БазаПР.NewObject("Запрос");
	ЗапросБУ.Текст =  "
	|ВЫБРАТЬ
	|	Начисления.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(Начисления.Результат) КАК СуммаНачислено,
	|	0 КАК СуммаФОТ,
	|	0 КАК СуммаНалогов,
	|	Начисления.Сотрудник.Физлицо.Наименование
	|ПОМЕСТИТЬ ОбщаяТЗ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
	|	И Начисления.ВидРасчета.Код <> ""00021""
	|	И Начисления.Результат <> 0
	|	И Начисления.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник.Физлицо.КодПоДРФО,
	|	Начисления.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Результат),
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	РегистрРасчета.ВзносыВФонды КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ВзносыВФондыИНалоги.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
	|	И ВзносыВФондыИНалоги.Результат <> 0
	|	И ВзносыВФондыИНалоги.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.НалогПриход),
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоНДФЛ.Обороты(&ПериодРегистрации, &КонПериода, , ) КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.НалогПриход <> 0
	|	И ВзносыВФондыИНалоги.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(ВзносыВФондыИНалоги.Сумма),
	|	0,
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезБанк)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Сумма <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	СУММА(ВзносыВФондыИНалоги.Налог),
	|	0,
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Налог <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Налог),
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Налог <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	0,
	|	СУММА(ВзносыВФондыИНалоги.Результат),
	|	0,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК ВзносыВФондыИНалоги
	|ГДЕ
	|	ВзносыВФондыИНалоги.Ссылка.ВидВыплаты = ЗНАЧЕНИЕ(Справочник.ВидыВыплат.АвансПредварительныйРасчет)
	|	И ВзносыВФондыИНалоги.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И &УчитыватьАванс
	|	И ВзносыВФондыИНалоги.Результат <> 0
	|	И ВзносыВФондыИНалоги.Ссылка.Организация.Код = &Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзносыВФондыИНалоги.Сотрудник.Физлицо.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяТЗ.СотрудникФизлицоКодПоДРФО,
	|	СУММА(ОбщаяТЗ.СуммаНачислено) КАК СуммаНачисления,
	|	СУММА(ОбщаяТЗ.СуммаФОТ) КАК СуммаФОТ,
	|	СУММА(ОбщаяТЗ.СуммаНалогов) КАК СуммаНалогов,
	|	ОбщаяТЗ.СотрудникФизлицоНаименование
	|ИЗ
	|	ОбщаяТЗ КАК ОбщаяТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТЗ.СотрудникФизлицоКодПоДРФО,
	|	ОбщаяТЗ.СотрудникФизлицоНаименование"; 
	
	ЗапросБУ.УстановитьПараметр("Код",Объект.Организация.Код);
	ЗапросБУ.УстановитьПараметр("ПериодРегистрации",НачалоМесяца(Объект.Дата));
	ЗапросБУ.УстановитьПараметр("КонПериода",КонецДня(КонецМесяца(Объект.Дата)));
	
	//ЗапросБУ.УстановитьПараметр("УчитыватьАванс",?(КонецМесяца(Объект.Дата)=КонецМесяца(ТекущаяДата()),Истина,ЛОЖЬ));
	ЗапросБУ.УстановитьПараметр("УчитыватьАванс",Объект.УчитыватьАванс);
	Выборка = ЗапросБУ.Выполнить().Выбрать();
	
	Объект.Сотрудники.Очистить();
	Объект.Распределение.Очистить();
	//Объект.Распределение.Очистить();
	Пока Выборка.Следующий() Цикл
		//Сообщить(""+Выборка.СотрудникФизлицоНаименование+"  "+Выборка.СуммаНачислено);
		нСотр= Справочники.Сотрудники.НайтиПоРеквизиту("Инн",Выборка.СотрудникФизлицоКодПоДРФО);
		Если нСотр.Пустая() Тогда
			Сообщить("Не найден сотрудник "+Выборка.СотрудникФизлицоНаименование+", ИНН  "+Выборка.СотрудникФизлицоКодПоДРФО);
		КонецЕсли;
		
		нСТр  =  Объект.Сотрудники.Добавить();
		нСТр.Сотрудник=нСотр;
		нСтр.СуммаНачисления= Число( Строка(Выборка.СуммаНачисления));
		нСтр.СуммаФОТ= Число( Строка(Выборка.СуммаФОТ));
		нСтр.СуммаНалогов= Число( Строка(Выборка.СуммаНалогов));
	КонецЦикла;
	
	
	
	//Исключения, выллаты через кассу
	ЗапросБУ=  БазаПР.NewObject("Запрос");
	ЗапросБУ.Текст =  "
	|ВЫБРАТЬ
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник,
	|	СУММА(ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов) КАК Сумма,
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник.Физлицо.КодПоДРФО,
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник.Наименование
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	|ГДЕ
	|	ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &НачПериода И &КонПериода
	|	И ВзаиморасчетыСРаботникамиОрганизаций.Организация.Код = &Код
	|	И ВзаиморасчетыСРаботникамиОрганизаций.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезКассу)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСРаботникамиОрганизаций.Сотрудник	";

	
	//ЗапросБУ.УстановитьПараметр("НачДАта",НачалоМесяца(Объект.Дата)+60*60*24);
	//ЗапросБУ.УстановитьПараметр("КОнДАта",КонецДня(КонецМесяца(Объект.Дата))+60*60*24);
	
	ЗапросБУ.УстановитьПараметр("Код",Объект.Организация.Код);
	ЗапросБУ.УстановитьПараметр("НачПериода",Объект.КассаДатаС);
	ЗапросБУ.УстановитьПараметр("КонПериода",КонецДня(Объект.КассаДатаПо));
	
	
	Выборка = ЗапросБУ.Выполнить().Выбрать();
	
	Объект.СотрудникиИсключения.Очистить();
	Пока Выборка.Следующий() Цикл
		//Сообщить(""+Выборка.СотрудникФизлицоНаименование+"  "+Выборка.СуммаНачислено);       
		Если ЗначениеЗаполнено(Выборка.СотрудникФизлицоКодПоДРФО) Тогда
			нСотр= Справочники.Сотрудники.НайтиПоРеквизиту("Инн",Выборка.СотрудникФизлицоКодПоДРФО);	
		Иначе
			нСотр= Справочники.Сотрудники.НайтиПоНаименованию(Выборка.СотрудникФизлицоНаименование);	
		КонецЕсли;
		
		Если нСотр.Пустая() Тогда
			Сообщить("Не найден сотрудник "+Выборка.СотрудникФизлицоНаименование+", ИНН  "+Выборка.СотрудникФизлицоКодПоДРФО+?(Выборка.СотрудникФизлицоКодПоДРФО=""," *** ВНИМАНИЕ, не заполнен ИНН",""));
		КонецЕсли;
		
		нСТр  =  Объект.СотрудникиИсключения.Добавить();
		нСТр.Сотрудник=нСотр;
		нСТр.СуммаВыплаты=Число(Строка(Выборка.Сумма));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзБухгалтерии(Команда)
	ПолучитьДанныеИзБухгалтерииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	Запрос = Новый Запрос;
	
	Запрос.Текст=    "ВЫБРАТЬ
	                 |	РаспределениеЗаработнойПлатыСотрудники.Сотрудник КАК Сотрудник,
	                 |	ВЫБОР
	                 |		КОГДА &ОпределятьНаправлениеПоТабелю
	                 |				И НЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА ЕСТЬNULL(ДанныеТабелированияОбороты.Направление, РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеНаправление)
	                 |		ИНАЧЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеНаправление
	                 |	КОНЕЦ КАК Направление,
	                 |	ВЫБОР
	                 |		КОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение
	                 |		ИНАЧЕ ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, ВЫБОР
	                 |					КОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	                 |						ТОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.Родитель.ОсновноеПодразделение
	                 |					ИНАЧЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение
	                 |				КОНЕЦ)
	                 |	КОНЕЦ КАК Подразделение,
	                 |	ЕСТЬNULL(СУММА(ДанныеТабелированияОбороты.ЧасыФактОборот), 0) КАК ОтработаноЧасов
	                 |ИЗ
	                 |	Документ.РаспределениеЗаработнойПлаты.Сотрудники КАК РаспределениеЗаработнойПлатыСотрудники
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДанныеТабелирования.Обороты(&НачПериода, &КонПериода, Регистратор, {(Организация = &Организация) КАК Поле2}) КАК ДанныеТабелированияОбороты
	                 |		ПО РаспределениеЗаработнойПлатыСотрудники.Сотрудник = ДанныеТабелированияОбороты.Сотрудник
	                 |			И (ДанныеТабелированияОбороты.Состояние В (&СпСостояний))
	                 |			И (НЕ ДанныеТабелированияОбороты.Регистратор.НеРаспределять)
	                 |ГДЕ
	                 |	РаспределениеЗаработнойПлатыСотрудники.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ДанныеТабелированияОбороты.Сотрудник,
	                 |	ДанныеТабелированияОбороты.Подразделение,
	                 |	РаспределениеЗаработнойПлатыСотрудники.Сотрудник,
	                 |	ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение),
	                 |	ВЫБОР
	                 |		КОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение
	                 |		ИНАЧЕ ЕСТЬNULL(ДанныеТабелированияОбороты.Подразделение, ВЫБОР
	                 |					КОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	                 |						ТОГДА РаспределениеЗаработнойПлатыСотрудники.Сотрудник.Родитель.ОсновноеПодразделение
	                 |					ИНАЧЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеПодразделение
	                 |				КОНЕЦ)
	                 |	КОНЕЦ,
	                 |	ВЫБОР
	                 |		КОГДА &ОпределятьНаправлениеПоТабелю
	                 |				И НЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.РаспределятьПоКарточке
	                 |			ТОГДА ЕСТЬNULL(ДанныеТабелированияОбороты.Направление, РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеНаправление)
	                 |		ИНАЧЕ РаспределениеЗаработнойПлатыСотрудники.Сотрудник.ОсновноеНаправление
	                 |	КОНЕЦ
	                 |ИТОГИ
	                 |	СУММА(ОтработаноЧасов)
	                 |ПО
	                 |	Сотрудник"    ;
	СпСостояний=Новый СписокЗначений();
	СпСостояний.Добавить("Р");
	ЗАпрос.УстановитьПараметр("СпСостояний",СпСостояний);
	ЗАпрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	СпСотрудников = Новый СписокЗначений;
	Для каждого Стр Из Объект.Сотрудники Цикл
		СпСотрудников.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	
	Запрос.УстановитьПараметр("ОпределятьНаправлениеПоТабелю",Объект.ОпределятьНаправлениеПоТабелю);
	Если Объект.ОтбиратьТабельПоОрганизации Тогда
		ЗАпрос.УстановитьПараметр("Организация",Объект.Организация);	
	КонецЕсли;
	ЗАпрос.УстановитьПараметр("СпСотрудников",СпСотрудников);
	
	ЗАпрос.УстановитьПараметр("НачПериода",НачалоДня(НачалоМесяца(Объект.Дата)));
	ЗАпрос.УстановитьПараметр("КонПериода",КонецДня(КонецМесяца(Объект.Дата)));
	Объект.Распределение.Очистить();
	
	ВЫборкаСотр = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВЫборкаСотр.Следующий() Цикл
		ВыборкаПодр = ВЫборкаСотр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВсегоОтработано =   ВЫборкаСотр.ОтработаноЧасов;
		СтрокаСотрудник = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник",ВЫборкаСотр.Сотрудник)); 
		
		//НужноРаспределить = СтрокаСотрудник[0].СуммаНачисления+СтрокаСотрудник[0].СуммаФОТ;
		
		УжеРаспределилиСуммаНачисления = 0;
		УжеРаспределилиСуммаФОТ= 0;
		УжеРаспределилиСуммаНалогов= 0;
		
		Пока ВыборкаПодр.Следующий() Цикл
			нСТр =   Объект.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств(нСТр,ВыборкаПодр);  
			Если Не ЗначениеЗаполнено(Нстр.Направление) Тогда  
				  Нстр.Направление = Нстр.Сотрудник.ОсновноеНаправление;
			КонецЕсли;
			Если ВсегоОтработано > 0 Тогда
				нСТр.СуммаНачисления= Окр(СтрокаСотрудник[0].СуммаНачисления*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				нСТр.СуммаФОТ= Окр(СтрокаСотрудник[0].СуммаФОТ*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				нСТр.СуммаНалогов= Окр(СтрокаСотрудник[0].СуммаНалогов*(нСТр.ОтработаноЧасов/ВсегоОтработано),2);
				
				УжеРаспределилиСуммаНачисления=УжеРаспределилиСуммаНачисления+   нСТр.СуммаНачисления;
				УжеРаспределилиСуммаФОТ=УжеРаспределилиСуммаФОТ+   нСТр.СуммаФОТ;
				УжеРаспределилиСуммаНалогов=УжеРаспределилиСуммаНалогов+   нСТр.СуммаНалогов;
			ИНаче
				//Вся сумма на 1 строку
				Если ВыборкаПодр.Количество()=1 Тогда
					нСТр.СуммаНачисления= СтрокаСотрудник[0].СуммаНачисления;
					нСТр.СуммаФОТ= СтрокаСотрудник[0].СуммаФОТ;
					нСТр.СуммаНалогов= СтрокаСотрудник[0].СуммаНалогов;
					
					
					УжеРаспределилиСуммаНачисления=УжеРаспределилиСуммаНачисления+   нСТр.СуммаНачисления;
					УжеРаспределилиСуммаФОТ=УжеРаспределилиСуммаФОТ+   нСТр.СуммаФОТ;
					УжеРаспределилиСуммаНалогов=УжеРаспределилиСуммаНалогов+   нСТр.СуммаНалогов;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаСотрудник[0].СуммаНачисления-УжеРаспределилиСуммаНачисления<>0 Тогда
			нСТр.СуммаНачисления=нСТр.СуммаНачисления+СтрокаСотрудник[0].СуммаНачисления-УжеРаспределилиСуммаНачисления;
		КонецЕсли;
		
		Если СтрокаСотрудник[0].СуммаФОТ-УжеРаспределилиСуммаФОТ<>0 Тогда
			нСТр.СуммаФОТ=нСТр.СуммаФОТ+СтрокаСотрудник[0].СуммаФОТ-УжеРаспределилиСуммаФОТ;
		КонецЕсли;

		Если СтрокаСотрудник[0].СуммаНалогов-УжеРаспределилиСуммаНалогов<>0 Тогда
			нСТр.СуммаНалогов=нСТр.СуммаНалогов+СтрокаСотрудник[0].СуммаНалогов-УжеРаспределилиСуммаНалогов;
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры
